flameSpread_SBI/constant/panelRegion/reactions
species
(
    v
    char
);

gaseousSpecies
(
    gas
);

reactions
{
    charReaction
    {
        type        irreversibleArrheniusSolidReaction;
        reaction    "v^0.66 = char + gas";
        A           1.47e4;
        Ta          8648.06;
        Tcrit       400;
    }
}

